{"Names":{"0":"HDFC Bank INFINIA Credit Card Metal Edition","1":"HDFC Bank Diners Club Black Credit Card","2":"HDFC Bank Regalia Credit Card","3":"HDFC Bank Diners Club Premium Credit Card","4":"HDFC Bank Millennia Credit Card","5":"HDFC Diners Club Privilege Credit Card","6":"HDFC Bank Diners Club Rewardz Credit Card"},"Best For":{"0":"Travel , Dining , Shopping","1":"Travel , Shopping","2":"Travel","3":"Shopping","4":"Travel","5":"Travel","6":"Shopping"},"Joining Fee":{"0":"Rs. 10,000 (plus applicable taxes)","1":"Rs. 2,500 (plus applicable taxes)","2":"Rs. 2,500 (plus applicable taxes)","3":"Rs. 1,000 (plus applicable taxes)","4":"Rs. 2,500 (plus applicable taxes)","5":"Rs. 1,000 (plus applicable taxes)","6":"Rs. 1,499"},"Renewal Fee":{"0":"Rs. 10,000 (plus applicable taxes)","1":"Rs. 2,500 (plus applicable taxes)","2":"Rs. 2,500 (plus applicable taxes)","3":"Rs. 1,000 (plus applicable taxes)","4":"Rs. 2,500 (plus applicable taxes)","5":"Rs. 1,000 (plus applicable taxes)","6":"Rs. 1,499"},"Welcome Bonus":{"0":"Complimentary memberships for a year to MMTDOUBLEBLACK, Zomato Gold, Club Marriott, Times Prime, and Amazon Prime.","1":"2,500 bonus Reward points","2":"2,500 bonus Reward Points","3":"1,000 CashPoints as a Welcome Benefit.","4":"Complimentary membership of Amazon Prime, Big Basket Star, MakeMyTrip Black Elite Tier, Zomato Pro, Times Prime Smart with HDFC Diners Club Privilege credit card","5":"1,000 Reward Points","6":"1,499 NeuCoins as a welcome benefit"},"Reward Rates":{"0":"5 Reward Points for every Rs. 150 spent, accelerated Reward Points while spending on SmartBuy","1":"4 reward points every time one spends Rs. 150.","2":"4 Reward Points on every retail spend of Rs. 150. Savings of up to 1.3% on all your spends through this card","3":"5% cashback (as CashPoints) at select partner online merchants and 1% cashback (as CashPoints) on all other spends (except fuel)","4":"4 Reward Points on every Rs 150 spent, reward rate of up to 1.33%","5":"3 Reward points per Rs. 150 spent and 10X on shopping through partner brands.","6":"10% cashback (in the form of Neucoins) on the Tata Neu app, 5% cashback on Tata partner brands, and 1.5% cashback elsewhere."},"travel":{"0":"Complimentary lounge access at 1,000+ airports in India and abroad, Reward Points redeemable for flight and hotel bookings on SmartBuy (1RP = Re. 1).","1":"Complimentary Domestic and International Lounge Access. You get complimentary travel insurance as well.","2":"Complimentary lounge access at more than 1,000 airports lounges globally","3":"Complimentary airport lounge access every year.","4":"Complimentary membership of MakeMyTrip Black Elite Tier using this card. You also get complimentary lounge access at both domestic and international destinations with HDFC Diners Club Privilege credit card.","5":"You can use the Reward points to book hotel\/flights bookings on Smartbuy.","6":"Complimentary lounge access to domestic and international airport lounges."},"Domestic Lounge Access":{"0":"Unlimited complimentary access to the domestic lounges","1":"12 free airport lounge access per year within India.","2":"Up to 6 domestic airport lounge access every year","3":"2 complimentary visits per quarter. (8 in a year)","4":"Up to 12 complimentary domestic lounge access every year","5":null,"6":"8 complimentary domestic lounge access every calendar year"},"Insurance Benefits":{"0":"Travel-related insurance benefits including an air accident cover worth Rs. 2 crores and a credit liability cover worth up to Rs. 9 lakh.","1":"Insurance cover worth Rs. 1 Crore against accidental air death and coverage of up to Rs. 15 lakhs against emergency hospitalization for overseas treatment.","2":"Insurance cover of Rs. 1 Crore for an air accident, coverage worth Rs. 25 lakhs for emergency hospitalization, and a cover worth Rs. 50,000 for baggage delay","3":null,"4":"Insurance cover worth up to Rs 1 crore in case of an air accident and an emergency cover of Rs 25 lac in case of hospitalization abroad.","5":null,"6":"Insurance cover worth Rs. 1 crore against air accident, cover worth Rs. 15 lakhs against emergency hospitalization, and lost card liability cover worth up to Rs. 9 lakhs."},"Movie & Dining":{"0":"2X Reward Points on weekend dining, complimentary annual membership of Zomato Gold.","1":"Exclusive dine-out passport membership, 5% off additionally, and early access to several festivals & events.","2":null,"3":"Up to 20% discount at partner restaurants with complimentary Dineout Passport membership","4":"Complimentary Dineout passport membership for three months and Complimentary subscription to Zomato Pro valid for 12 months.","5":"Complimentary Dineout passport membership for 3 months and 5% off additionally on dining.","6":null},"Reward redemption":{"0":"HDFC Bank Diners Club Black Reward Points are redeemable for flight\/hotel bookings (1 RP = Re. 1) on SmartBuy, for AirMiles (1 RP = 1 AirMile), on Diners Club exclusive rewards redemption catalog (1 RP = Re. 0.5) and for cashbacks (1RP = Rs. 0.30).","1":"1 RP = Rs. 0.5 for redemption against flights and hotel bookings on HDFC Smartbuy website, 1 RP = up to Rs. 0.35 if you want to redeem against vouchers and poducts, 1 RP = Rs 0.20 for cash back, and Air miles conversion at a value of 1RP = 0.5 air mile.","2":"You can redeem reward points against air tickets, and for AirMiles across Singapore Airlines at a rate of 1 RP = 0.50 Air Miles. 1 RP = Rs. 0.50 for redemption against Flight\/Hotel bookings through Smartbuy, 1 RP = up to Rs. 0.35 for redemption against products & vouchers, and 1 RP = Rs. 0.20 for CashBack","3":"Rewards processed as CashPoints, 1 CP = Re. 1 while redeeming against statement balance of credit card and 1 CP = Rs. 0.30 while redeeming against products and vouchers in the product catalogue, and against flight\/hotel booking.","4":"1 reward point = Rs 0.5 redeemable on SmartBuy reward portal for flight & hotels bookings, 1 reward point = 0.5 Air miles.","5":"For redemption against flight\/hotel bookings on SmartBuy, 1 Reward Point = Rs. 0.30, 1 Reward Point = 0.30 Airmiles, 1 Reward Point = up to Rs. 0.25 for redemption against product catalogue, 1 Reward Point = Rs. 0.15 for redemption against cashback.","6":"The earned Neu Coins can be redeemed against Tata partner brands on the tata Neu app at a rate of 1 Neu Coin = Re. 1."},"Golf":{"0":"6 complimentary golf games per quarter at some of the most premium golf destinations around the world.","1":null,"2":null,"3":null,"4":"Get 8 complimentary golf games(2 per quarter) at select golf courses annually in India and abroad.","5":null,"6":null},"International lounge access":{"0":"Unlimited complimentary access to the international lounges","1":"6 airport lounge access every year outside India through the priority pass.","2":"Up to 6 international airport lounge access every year","3":null,"4":"Up to 12 complimentary international lounge access every year","5":null,"6":"4 complimentary international lounge access each year"},"Zero Liability Protection":{"0":"Zero liability protection worth Rs. 9 lakh against a lost\/stolen card.","1":"You get zero liability protection cover up to Rs 9 lacs in case of misuse or loss of card.","2":"The cardholder will not be liable for any fraudulent transaction done through his\/her lost\/stolen credit card if reported to the bank within 24 hours of the loss","3":"Zero liability of the credit cardholder in case of fraudulent transactions after you have reported about the loss or theft of the card to the bank.","4":"Protection cover of Rs 9 lac in case of any fraudulent transaction reported within a stipulated time on HDFC Diners Club Privilege credit card","5":"The cardholder will not be liable for any transactions done on the card once the card is reported lost\/stolen to the bank.","6":"The cardholders will not be liable against any fraudulent transactions made on a lost\/stolen if they report the loss of their card within 48 hours."},"Spend based waiver":{"0":"Waiver of renewal fee on spending Rs. 5,00,000 in the previous year.","1":"Get the annual fee waived off (second-year onwards) by spending more than 3 lakh in the previous year.","2":"Renewal fee waived off for this card on spending over Rs. 3 lakhs within one anniversary year","3":"The renewal fee is waived off if the cardholder spends Rs. 1 Lakh or more in the previous year.","4":"Renewal fee waiver on spending over Rs. 3 lakhs in the previous year.","5":"Renewal fee waived off on spending Rs. 1 lakh or more in the previous year.","6":"The renewal fee is waived off on achieving annual spends of rs. 3 lakhs or more."},"Reward redemption fee":{"0":null,"1":"Rs 99 (plus applicable taxes)","2":"Rs. 99 (plus applicable taxes)","3":"Rs. 99 per redemption request (plus applicable taxes)","4":"Rs 99 per redemption request (plus applicable taxes)","5":"Rs. 99 on every redemption request (plus applicable taxes)","6":null},"Foreign currency markup":{"0":"1.99% (plus applicable taxes)","1":"2% on all foreign currency transactions.","2":"2% on all foreign currency transactions (plus applicable taxes)","3":"3.5% (plus applicable taxes)","4":"1.99% of the conversion amount (plus applicable taxes)","5":"3% (plus applicable taxes)","6":"2% of the total conversion amount."},"Interest Rates":{"0":"1.99% per month (or 23.88% annually)","1":"3.6% per month or 43.2% annually","2":"3.6% per month (or 43.2% annually)","3":"3.6% per month (or 43.2% per annum)","4":"3.6% per month (43.2% per annum)","5":"3.6% per month (43.2% annually)","6":"3.49% per month, i.e, 41.88% per annum"},"Fuel Surcharge":{"0":"1% fuel surcharge waived (max waiver capped at Rs. 1,000\/month and min transaction of  Rs. 400 required).","1":"1% fuel surcharge waiver at all fuel stations in India on a minimum of Rs. 400 transaction and a maximum of Rs. 5000 transaction.","2":"1% fuel surcharge waived off on all fuel transactions between Rs. 400 to Rs. 5,000","3":"1% Fuel surcharge which is waived if you spend minimum Rs 400 in single transaction. The maximum CashBack is capped at Rs. 250 per payment cycle.","4":"1% fuel surcharge waiver on fuel transactions at all fuel stations subject to a maximum waiver of Rs 500 per statement cycle","5":"1% fuel surcharge waived off for all transactions between Rs. 400 & Rs. 5,000.","6":"1% fuel surcharge waiver for all fuel transactions between Rs. 400 and Rs. 5,000."},"Cash advance charge":{"0":"Higher of 2.5% of the amount withdrawn or Rs. 500.","1":"2.5% of the transaction amount or Rs. 500 (whichever is higher)","2":"2.5% of the cash amount withdrawn or Rs. 500 (whichever is higher)","3":"2.5% of the transaction amount, subject to a minimum fee of Rs. 500","4":"2.5 % of the withdrawal amount subject to a minimum charge of Rs 500","5":"2.5% of the amount transacted or a minimum of Rs. 500.","6":"2.5% of the withdrawn amount, subject to a minimum fee of Rs. 500."},"Add on card fee":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null}}